---
kind: property
id: P:Autodesk.Revit.DB.ViewSet.IsEmpty
source: html/19473d0e-4c42-c7a3-f539-dd1e34361a19.htm
---
# Autodesk.Revit.DB.ViewSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.